# Result: 3

return () = (5 + 4) - (3 * 2) / 1

test#basic () = 
  do
    assert#equal 6 (3 + 3)
    assert#equal 9 (3 * 3)
    assert#equal 0 (3 - 3)
    assert#equal 1 (3 / 3)
    
test#power () = 
  do
    assert#equal 9 3 ** 2
    
test#bitwise () = 
  do
    assert#equal 0 (1 & 0)
    assert#equal 1 (1 | 0)

main () = 
  do
    test#basic
    test#power
    test#bitwise
    return
