# Result: integer, 1

import "assertions"

test#integer () = 
  do
    assert#equal  2 (1 + 1)
    assert#equal  0 (1 + -1)
    assert#equal -2 (-1 + -1)
    assert#equal  3 (1 + 1 + 1)
    assert#equal  1 (3 - 2)
    assert#equal -1 (2 - 3)
    assert#equal  6 (2 * 3)
    assert#equal  2 (4 / 2)
    assert#equal  1 (3 / 2)
		assert#equal  1 ((3 * 2) - 4) / 2
		
test#float () = 
  do
  	assert#equal  2.0 (1.0 + 1.0)
  	assert#equal  0.0 (1.0 + -1.0)
  	assert#equal -2.0 (-1.0 + -1.0)
  	assert#equal  3.0 (1.0 + 1.0 + 1.0)
  	assert#equal  1.0 (3.0 - 2.0)
  	assert#equal -1.0 (2.0 - 3.0)
  	assert#equal  6.0 (2.0 * 3.0)
  	assert#equal  2.0 (4.0 / 2.0)
  	assert#equal  1.5 (3.0 / 2.0)
		assert#equal  1.0 ((3.0 * 2.0) - 4.0) / 2.0
		assert#equal  0.333333333333333 (1.0 / 3.0)
		assert#equal  1.61803398874989 ((1.0 + 2.23606797749979) / 2.0)
	
test#both () = 
  do
    assert#equal  1.0 (1 * 1.0)
    assert#equal  1.0 (1.0 * 1)
    assert#equal  2.0 (2 * 1.0)
    assert#equal  2.0 (2.0 * 1)
		assert#equal  1.61803398874989 ((1 + 2.23606797749979) / 2)
    
main () = 
  do
    test#integer
		test#float
		test#both